12/data/attachments/6121450304249877.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Ashley_much_Friend_42337_4</nif:username>
            <nif:friendToBeRequested>soap_friends_fdf39a80-fddd-4299-b9d4-02777f16295a</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>